{
  "backend/main.mo": "Empty Motoko canister actor with no methods defined.",
  "feature_evidence.json": "Feature evidence report listing three high-confidence image update and content‑consistency requirements.",
  "frontend-file-summaries.txt": "Text file summarizing key frontend files and recent updates such as new assets and removed cardiology references.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables for light and dark themes and applying global styles.",
  "frontend/index.html": "Main HTML entry with SEO metadata and favicon links pointing to the generated favicon asset.",
  "frontend/src/App.tsx": "Simple root component rendering the LandingPage.",
  "frontend/src/components/ContactSection.tsx": "Renders a styled contact section using centralized contact constants; includes address, phones, email, and emergency info.",
  "frontend/src/components/Footer.tsx": "Footer displaying hospital info, contact links, location, and attribution using shared contact constants.",
  "frontend/src/components/SpecialtiesSection.tsx": "Displays seven medical specialties using icons and descriptions sourced from centralized department constants.",
  "frontend/src/constants/departmentDisplay.ts": "Defines names and descriptions for seven medical departments for consistent use across components.",
  "frontend/src/constants/hospitalContact.ts": "Centralized hospital contact data including phones, email, address, name, and tagline.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and tracks an authenticated or anonymous backend actor and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, and identity loading via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file reserved for future React Query hooks; currently exports nothing.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom CSS variables for the site's color theme, typography, and global styles including light/dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/LandingPage.tsx": "Implements the main landing page UI with hero, contact actions, about section, specialties, and footer using hospital contact constants.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radii, animations, typography, and plugins for the site’s design system.",
  "project_state.json": "Stores project metadata, requirements, existing features, and constraints for updating the KVR Hospital website."
}